app/controllers/rooms_controller.rb

  def show
    @room = Room.find params[:id]
---
SELECT * FROM "rooms" WHERE ("rooms"."id" = 1)

  def create
    @room = Room.create params[:room]
---
INSERT INTO "rooms" ("name", "number", "created_at", "unit_id", "updated_at", "rent") VALUES('Desmond''s room', '1', '2010-05-17 18:54:05', 1, '2010-05-17 18:54:05', 200)

  def index
    @rooms = if params[:unit_id]
      Unit.find(params[:unit_id]).rooms
    else
      Room.all
---
SELECT * FROM "rooms" WHERE ("rooms".unit_id = 1)
SELECT * FROM "units" WHERE ("units"."id" = 1)
SELECT * FROM "rooms"