app/controllers/units_controller.rb

  def create
    @unit = Unit.create params[:unit]
---
INSERT INTO "units" ("name", "address", "number", "created_at", "updated_at", "rent") VALUES('Mode on 5th', '116 n 5th st, Brooklyn NY 11211', 'Studio 1', '2010-05-17 18:21:34', '2010-05-17 18:21:34', NULL)

  def index
    @units = Unit.all
---
SELECT * FROM "units"

  def show
    @unit = Unit.find params[:id]
---
SELECT * FROM "units" WHERE ("units"."id" = 6)

  def edit
    @unit = Unit.find params[:id]
---
SELECT * FROM "units" WHERE ("units"."id" = 1)